[
  {
    "id": "1",
    "title": "Welcome to My Blog",
    "author": "Connor",
    "date": "2025-07-23",
    "content": "This is the first post on my new blog!",
    "tags": ["intro", "welcome"]
  },
  {
    "id": "2",
    "title": "1984 in 2025",
    "author": "Connor",
    "date": "2025-07-25",
    "content": "Growing up in America, we are taught that the foundation of our country is built upon the United States Constitution. Most importantly the first amendment which guarantees us our freedom of speech, religion, assembly, the press, and the right to petition. However, the current administration has shown no sign of respecting these freedoms. That is unless you agree with the current agenda. Recently the GOP has slashed funding towards the CPB, which limits the reach of many local broadcasting stations under NPR and PBS due to supposed left-wing bias. This along with further retaliation towards outlets such as CBS, NBC, ABC, and more puts many media outlets in a time of uncertainty whether the next headline criticizing the current republican agenda will be their demise. The current agenda has completely tarnished what we are supposed to stand for in Western media, and creates a parallel between real life and George Orwell's 1984, leaving many Americans feeling like Big Brother is always watching and controlling what you do.",
    "tags": ["update"]
  },
  {
    "id": "3",
    "title": "Vanisher: Horizon Scraper",
    "author": "Connor",
    "date": "2025-07-28",
    "content": "For the past few years, singer-songwriter and producer Quadeca has focused heavy into the production of his albums. Beginning with his project Dustcutter, we've seen a big influx of conceptual songs and experimental sounds, and Vanisher: Horizon Scraper takes this to a different level. Beginning with NO QUESTIONS ASKED, this project is automatically pulling the listener to an ethereal state and it doesn't let go until a sudden crash at the end with CASPER. Without bias this album is undeniably a 10/10 on my scale for what it is. Some listeners arent fans of concept projects, so unfortunately I don't see a future where this album will recieve all the recognition it deserves. However if you enjoy conceptual art and appreciate an album that takes you on a trip that feel otherworldly, I highly recommend giving this album a listen.",
    "tags": ["update"]
  },
]
